#pragma once

#include "Pml/MonsNo.h"

#include "types.h"

namespace rec
{
    struct Reader {

    };
} // namespace rec

namespace TrainerTable
{
    struct SheetTrainerData;
    struct SheetTrainerType;
} // namespace TrainerTable

namespace PGLRecord
{
    struct RecParam;
} // namespace PGLRecord

struct BTL_POKEPARAM
{
    enum ValueID {

    };
};

namespace ServerSendData {
    struct CLIENT_LIMIT_TIME;
};

struct BATTLE_SETUP_PARAM;
struct BattleViewBase;
struct Random;
struct PokeParty;
struct MyStatus;
struct BtlRule {
    byte padding[0x4];
};
struct MSGSPEED;
struct BtlResult;
struct ResultCause;
struct BtlPokePos;
struct BATTLERULE;
struct BTL_SERVER;
struct ClientPublicInformation;
struct AdapterFactory;
struct PokeIDRec;
struct BattleEnv;
struct Client;
struct CapsuleData;
struct IEnumerator;
struct BtlBagMode;
struct MiseaiData;
struct BattleEnv;
struct BtlBagMode;
struct BattleEnv;
struct BTL_CLIENT_ID;
struct BtlCommMode;
struct BtlEscapeMode;
struct BTL_FIELD_SITUATION;
struct BtlWeather;
struct BattleEffectComponentData;
struct BTL_CLIENT_ID;
struct BtlMultiMode;
struct BtlSide;
struct POKECON;
struct BtlvPos;
struct CaptureInfo;
struct ResultCause;
struct ResultCause;
struct MoneyDblUpCause;
struct DaisukiType;
struct BTL_PARTY;
struct BTL_STATUS_FLAG;
struct RECORD_ID;
struct RECORD_ID;
struct EvolveSituation;
struct BTL_CLIENT;
struct TRAINER_DATA;
struct BSP_TRAINER_DATA;
struct TrainerID;
struct TrainerMessageID;
struct TrainerSequenceID;
struct TrainerMessageID;
struct Sex;
struct TrainerType;
struct TrainerTypeGroup;
struct HandDominance;
struct HandDominance;
struct ClientPublicInformation;
struct PokemonParam;
struct PartyDesc;
struct RaidBattleParam;
struct BATTLE_CONVENTION_INFO;
struct AffixSealData;
struct CapsuleData;
struct PokemonParam;


namespace Dpr
{
    namespace Battle
    {
        namespace Logic
        {
            class MainModule {
                public:
                byte alignment[0x10]; // 0x0
                BATTLE_SETUP_PARAM *m_setupParam; // 0x10
                BattleViewBase *m_viewCore; // 0x18
                Random *m_randSys; // 0x20
                ulong m_randomSeed; // 0x28
                void* m_subProc; // 0x30
                int m_subSeq; // 0x38
                int m_setupStep; // 0x3C
                void* m_mainLoop; // 0x40
                PokeParty* m_srcParty; // 0x48
                PokeParty* m_srcPartyForServer; // 0x50
                PokeParty *m_tmpParty; // 0x58
                MyStatus *m_playerStatus; // 0x60
                bool* m_fClientQuit; // 0x68
                BtlRule m_rule; // 0x70
                uint m_regularMoney; // 0x74
                uint m_bonusMoney; // 0x78
                uint m_loseMoney; // 0x7C
                MSGSPEED *m_msgSpeed; // 0x80
                ushort *m_LimitTimeGame; // 0x84
                ushort *m_LimitTimeClient; // 0x86
                ushort *m_LimitTimeCommand; // 0x88
                BtlResult *m_serverResult; // 0x8C
                ResultCause *m_serverResultCause; // 0x90
                byte m_myClientID; // 0x94
                BtlPokePos *m_myOrgPos; // 0x95
                BATTLERULE *m_changeMode; // 0x98
                byte m_MultiAIDataSeq; // 0x9C
                byte m_MultiAIClientNum; // 0x9D
                byte* m_MultiAIClientID; // 0xA0
                bool m_fCommError; // 0xA8
                bool m_fCommErrorMainQuit; // 0xA9
                bool m_fWazaEffectEnable; // 0xAA
                bool m_fGetMoneyFixed; // 0xAB
                bool m_fLoseMoneyFixed; // 0xAC
                bool m_padding; // 0xAD
                bool m_isFinalizeStarted; // 0xAE
                BTL_SERVER* m_server; // 0xB0
                BTL_SERVER* m_cmdCheckServer; // 0xB8
                BTL_CLIENT* m_client; // 0xC0
                BTL_CLIENT* m_dummyClient; // 0xC8
                TRAINER_DATA* m_trainerParam; // 0xD0
                ClientPublicInformation* m_clientPublicInformation; // 0xD8
                AdapterFactory* m_adapterFactory; // 0xE0
                rec::Reader m_recReader; // 0xE8
                bool* m_moneyDblUpCause; // 0xF0
                uint** m_zukanDataOnBattleStart; // 0xF8
                PokeIDRec *m_deadPokeIDRec; // 0x100
                BattleEnv *m_battleEnvForClient; // 0x108
                BattleEnv *m_battleEnvForServer; // 0x110
                Client *m_iPtrNetClient; // 0x118
                bool isInitialized; // 0x120
                bool isFinalized; // 0x121
                static BtlvPos** rule_double_vpos; // 0x0
                static BtlvPos** rule_double_vpos_PA_A; // 0x8
                static BtlvPos** rule_raid_vpos1; // 0x10
                static BtlvPos** rule_raid_vpos2; // 0x18
                static BtlvPos** rule_raid_vpos3; // 0x20
                static BtlvPos** rule_raid_vpos4; // 0x28
                CapsuleData *DummyCapsuleData; // 0x128

                enum BtlDetailRule {

                };

                // RVA: 0x238FE60 Offset: 0x238FF61 VA: 0x238FE60
                BATTLE_SETUP_PARAM GetBattleSetupParam();

                // RVA: 0x238FE70 Offset: 0x238FF71 VA: 0x238FE70
                bool GetEnableTimeStop();

                // RVA: 0x238FE80 Offset: 0x238FF81 VA: 0x238FE80
                bool GetEnableVoiceChat();

                // RVA: 0x238FE90 Offset: 0x238FF91 VA: 0x238FE90
                bool IsSkyBattle();

                // RVA: 0x238FEA0 Offset: 0x238FFA1 VA: 0x238FEA0
                bool IsMustCaptureMode();

                // RVA: 0x238FEB0 Offset: 0x238FFB1 VA: 0x238FEB0
                void SetFairyGymResult(byte result);

                // RVA: 0x238FEC0 Offset: 0x238FFC1 VA: 0x238FEC0
                byte GetFairyGymResult();

                // RVA: 0x238FED0 Offset: 0x238FFD1 VA: 0x238FED0
